LK-Hour/Webcam-ESP32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_CAMERA_MODULE_CUSTOM=y
CONFIG_CAMERA_PIN_PWDN=-1
CONFIG_CAMERA_PIN_RESET=-1
CONFIG_CAMERA_PIN_XCLK=15
CONFIG_CAMERA_PIN_SIOD=4
CONFIG_CAMERA_PIN_SIOC=5
CONFIG_CAMERA_PIN_VSYNC=6
CONFIG_CAMERA_PIN_HREF=7
CONFIG_CAMERA_PIN_PCLK=13
CONFIG_CAMERA_PIN_Y2=11
CONFIG_CAMERA_PIN_Y3=9
CONFIG_CAMERA_PIN_Y4=8
CONFIG_CAMERA_PIN_Y5=10
CONFIG_CAMERA_PIN_Y6=12
CONFIG_CAMERA_PIN_Y7=18
CONFIG_CAMERA_PIN_Y8=17
CONFIG_CAMERA_PIN_Y9=16
CONFIG_FRAMESIZE_VGA=y
CONFIG_UVC_CAM1_FRAMERATE=15
CONFIG_UVC_CAM1_MULTI_FRAMESIZE=n
CONFIG_UVC_MODE_ISOC_CAM1=y
CONFIG_TUSB_PRODUCT="ESP32-S3 OV5640 Webcam"
